Revit 2024 API
BuiltInFailures.BendFailures.NotBentSymbol Property
 While making curved beam type "[Type Name]" Symbol elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotBentSymbol { get; }
Visual Basic
Public Shared ReadOnly Property NotBentSymbol As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotBentSymbol {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace